results/2026-07-14_v10_load_sweep/lfm2.5-8b-a1b/conc256/bench.log
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31244, dataset_name='mooncake', dataset_path='', model='/data/hf/LFM2.5-8B-A1B', served_model_name=None, tokenizer=None, num_prompts=1500, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=256, output_file='/home/t-jialianggu/work/EndtoEnd-auto-optimization/results/2026-07-14_v10_load_sweep/lfm2.5-8b-a1b/conc256/result.jsonl', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=0.02, mooncake_num_rounds=1, mooncake_workload='toolagent', tag=None, header=None)
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31244, dataset_name='mooncake', dataset_path='', model='/data/hf/LFM2.5-8B-A1B', served_model_name=None, tokenizer=None, num_prompts=1500, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=256, output_file='/home/t-jialianggu/work/EndtoEnd-auto-optimization/results/2026-07-14_v10_load_sweep/lfm2.5-8b-a1b/conc256/result.jsonl', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=0.02, mooncake_num_rounds=1, mooncake_workload='toolagent', tag=None, header=None)

Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
Using time-based Mooncake request scheduler, ignoring --request-rate.
Starting Mooncake trace replay. Sessions: 1500, Rounds per session: 1. Slowdown factor: 0.02
100%|██████████| 1500/1500 [00:37<00:00, 39.70it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 256       
Successful requests:                     1500      
Benchmark duration (s):                  37.83     
Total input tokens:                      3730759   
Total input text tokens:                 3730759   
Total generated tokens:                  276535    
Total generated tokens (retokenized):    276535    
Request throughput (req/s):              39.65     
Input token throughput (tok/s):          98609.98  
Output token throughput (tok/s):         7309.27   
Peak output token throughput (tok/s):    22800.00  
Peak concurrent requests:                326       
Total token throughput (tok/s):          105919.25 
Concurrency:                             215.32    
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   5430.93   
Median E2E Latency (ms):                 3554.26   
P90 E2E Latency (ms):                    14273.83  
P99 E2E Latency (ms):                    24065.77  
---------------Time to First Token----------------
Mean TTFT (ms):                          816.68    
Median TTFT (ms):                        205.48    
P99 TTFT (ms):                           3526.58   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          86.58     
Median TPOT (ms):                        33.37     
P99 TPOT (ms):                           897.02    
---------------Inter-Token Latency----------------
Mean ITL (ms):                           25.17     
Median ITL (ms):                         11.17     
P95 ITL (ms):                            92.00     
P99 ITL (ms):                            230.21    
Max ITL (ms):                            3268.39   
==================================================